Descriptor:
  Name: Copilot_IR_Playbook-Device
  DisplayName:  Custom Plugin Defender Device Investigation
  Description:  Incident Response playbook for suspicious Windows device, powered by Defender XDR, developed by Bi Yue Xu.

SkillGroups:
  - Format: KQL
    Skills:
      - Name: ListPast15DayFilesDownloaded
        DisplayName: File - Last 15 Days Files Downloaded
        Description: Lists files downloaded to this device in the last 15 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view file download activities.
            Required: true
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | where DeviceName contains '{{devicename}}'
           | where Timestamp > ago(15d)
           | where isnotempty(FileOriginUrl) and ActionType == "FileCreated"
           | project Timestamp, DeviceName, ActionType, FileName, FolderPath, FileOriginUrl, InitiatingProcessFileName, InitiatingProcessAccountName, InitiatingProcessCommandLine
           | sort by Timestamp desc 
 
      - Name: ListFilesDownloaded
        DisplayName: File - Files Downloaded
        Description: Lists files downloaded to this device in specific timeframe, in past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view file download activities.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00 
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where isnotempty(FileOriginUrl) and ActionType == "FileCreated"
           | project Timestamp, DeviceName, ActionType, FileName, FolderPath, FileOriginUrl, InitiatingProcessFileName, InitiatingProcessAccountName, InitiatingProcessCommandLine
           | sort by Timestamp desc 

      - Name: FileInDeviceEvents
        DisplayName: File - Any Device Events Related To This File
        Description: Display device events that include the filename, in specific timeframe.
        Inputs:
          - Name: filename
            Description: Provide the file name you want to search, e.g. DomainDominance198
            Required: true            
          - Name: starttime
            Description: Provide a start time in UTC e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time in UTC e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           union DeviceProcessEvents, DeviceFileEvents, DeviceNetworkEvents, DeviceRegistryEvents, DeviceEvents, DeviceLogonEvents, DeviceImageLoadEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | search '{{filename}}'

      - Name: SensitiveFilesEvents
        DisplayName: File - Sensitive Files Events
        Description: Lists sensitive files events on this device in the last 10 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view sensitive file activities.
            Required: true
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | where DeviceName contains '{{devicename}}'
           | where Timestamp > ago(10d)
           | where IsAzureInfoProtectionApplied == "1" or isnotempty(SensitivityLabel)
           | project Timestamp, ActionType, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName, SHA256, IsAzureInfoProtectionApplied, SensitivityLabel, SensitivitySubLabel
           | sort by Timestamp desc  

      - Name: FileOrigin
        DisplayName: File - File Origin
        Description: Display the origin or source of the file, in past 30 days.
        Inputs:
          - Name: filename
            Description: Provide the file name, e.g. DomainDominance198.ps1
            Required: true                       
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | where FileName contains '{{filename}}'
           | where Timestamp > ago(30d)
           | project Timestamp, DeviceName, FileName, FileOriginUrl, FileOriginReferrerUrl
           | sort by Timestamp desc
           
      - Name: ProcessExecutionSummary
        DisplayName: Process - Process Executions Summary
        Description: Summary of process executions on this device in specific timeframe, in past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view process execution activities.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceProcessEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | extend ProcessName = FileName, ProcessPath = FolderPath
           | summarize Count = count() by ProcessName, ProcessPath, AccountName
           | sort by ProcessName asc 

      - Name: ProcessExecutionDetails
        DisplayName: Process - Detailed Process Executions
        Description: Detailed all process execution events on device within a brief period, e.g. an hour.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view process execution activities.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceProcessEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | extend ProcessName = FileName, ProcessPath = FolderPath
           | project Timestamp, DeviceName, ProcessName, ProcessPath, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName
           | sort by Timestamp desc 
            
      - Name: ProcessDetailedExecution
        DisplayName: Process - Detailed Process Events
        Description: Detailed specific process execution events on device within a defined time frame.
        Inputs:
          - Name: processname
            Description: Provide the process name e.g. powershell
            Required: true  
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b
            Required: true              
          - Name: starttime
            Description: Provide a start time in UTC e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time in UTC e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceProcessEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where FileName contains '{{processname}}' or InitiatingProcessFileName contains '{{processname}}'
           | project Timestamp, DeviceName, AccountName, ActionType, ProcessName = FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName
           | sort by Timestamp asc
              
      - Name: RDPConnectionToThisDevice
        DisplayName: Lateral Movement - RDP To Device
        Description: Inbound RDP connection to this device in a specific timeframe.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view RDP events. 
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true              
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | extend StartTime = datetime('{{starttime}}')
            | extend EndTime = datetime('{{endtime}}')
            | where Timestamp between (StartTime .. EndTime)
            | where ActionType == "RemoteDesktopConnection"            
            | where DeviceName contains '{{devicename}}'
            | extend SourceIP = LocalIP
            | extend InternalPrivateIP = ipv4_is_private(SourceIP)
            | project Timestamp, ActionType, DeviceName, SourceIP, InternalPrivateIP
            | sort by Timestamp desc 

      - Name: RDPConnectionToThisDevice-Last10Days
        DisplayName: Lateral Movement - Last 10 Days RDP To Device
        Description: Inbound RDP connection to this device in past 10 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view RDP events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where ActionType == "RemoteDesktopConnection"
            | where Timestamp > ago(10d)
            | where DeviceName contains '{{devicename}}'
            | extend SourceIP = LocalIP
            | extend InternalPrivateIP = ipv4_is_private(SourceIP)
            | project Timestamp, ActionType, DeviceName, SourceIP, InternalPrivateIP
            | sort by Timestamp desc 
            
      - Name: LogonToDevice
        DisplayName: Lateral Movement - Logons To Device In Last 10 Days
        Description: Logon events from other devices to this device in the last 10 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view logon events to this device. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceLogonEvents
            | where Timestamp > ago(10d)
            | where DeviceName contains '{{devicename}}'
            | extend DestinationDevice = DeviceName, SourceDevice = RemoteDeviceName, SourceIP = RemoteIP, SourceIPType = RemoteIPType
            | project Timestamp, SourceDevice, SourceIP, SourceIPType, DestinationDevice, ActionType, LogonType, AccountName, Protocol, IsLocalAdmin
            | sort by Timestamp desc 

      - Name: LogonToDeviceWithTimeRange
        DisplayName: Lateral Movement - Logon To Device
        Description: Logon events from other devices to this device in a specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view logon events to this device.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true          
        Settings:
          Target: Defender
          Template: |-
           DeviceLogonEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | extend DestinationDevice = DeviceName, SourceDevice = RemoteDeviceName, SourceIP = RemoteIP, SourceIPType = RemoteIPType
           | project Timestamp, SourceDevice, SourceIP, SourceIPType, DestinationDevice, ActionType, LogonType, AccountName, Protocol, IsLocalAdmin
           | sort by Timestamp desc 

      - Name: DeviceOutboundNetworkEvents
        DisplayName: Network - Outbound Network Events
        Description: Device outbound network events, including attempts and failed connections, in a specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view outbound network events.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceNetworkEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("ConnectionSuccess", "ConnectionAttempt", "ConnectionFailed", "ConnectionRequest")
           | summarize NetworkConnectionCount = count() by InitiatingProcessFileName, InitiatingProcessFolderPath, RemoteIP, RemoteUrl, RemotePort, Protocol 

      - Name: DeviceInboundNetworkEvents
        DisplayName: Network - Inbound Network Events
        Description: Device inbound network events and attempts in a specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view inbound network events.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceNetworkEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("InboundConnectionAccepted", "InboundConnectionAcknowledged", "InboundConnectionAttempt")
           | summarize count() by ActionType, RemoteIP, RemotePort, LocalIP, LocalPort, Protocol          
 
      - Name: DevicelisteningPorts
        DisplayName: Network - Device Listening Ports
        Description: Displays device listening ports in specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceNetworkEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType == "ListeningConnectionCreated"
           | where LocalPort < 49151
           | project Timestamp, InitiatingProcessFileName, InitiatingProcessCommandLine, LocalPort
           | sort by LocalPort asc

      - Name: DeviceScheduledTask
        DisplayName: Device Events - Scheduled Task Events
        Description: Scheduled task events seen on a device in a specific timeframe, in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view scheduled tasks events.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("ScheduledTaskCreated", "ScheduledTaskDeleted", "ScheduledTaskUpdated")
           | project Timestamp, ActionType, InitiatingProcessAccountName, AdditionalFields, IsInitiatingProcessRemoteSession, IsProcessRemoteSession
           | sort by Timestamp desc 

      - Name: DeviceUserAccount
        DisplayName: Device Events - User Account Events
        Description: User account events seen on a device in a specific timeframe, in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view user account events.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("UserAccountCreated", "UserAccountDeleted", "UserAccountModified")
           | project Timestamp, ActionType, AccountName, AccountDomain, InitiatingProcessAccountName, AdditionalFields, IsInitiatingProcessRemoteSession, IsProcessRemoteSession
           | sort by Timestamp desc 

      - Name: DeviceUserAccountAddedOrRemovedFromLocalGroup
        DisplayName: Device Events - User Account Added Or Removed From Local Group
        Description: User account added or removed from local group on a device in a specific timeframe, in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view user account events.
            Required: true
          - Name: starttime
            Description: Provide a start time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true  
          - Name: endtime
            Description: Provide an end time e.g. Oct 3, 2024 18:00 or 2024-10-03 18:00
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("UserAccountAddedToLocalGroup", "UserAccountRemovedFromLocalGroup")
           | extend GroupInfo = parse_json(AdditionalFields)
           | extend GroupName = GroupInfo.GroupName, GroupDomainName= GroupInfo.GroupDomainName
           | project Timestamp, ActionType, AccountSid, GroupName, GroupDomainName, InitiatingProcessAccountName, InitiatingProcessAccountDomain
           | sort by Timestamp desc 

      - Name: DeviceASRRules
        DisplayName: Suspicious Activities - ASR Rules Triggered
        Description: ASR rules that were triggered on this device in the past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view ASR rules. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where Timestamp > ago(7d)
            | where ActionType startswith "Asr"
            | where DeviceName contains '{{devicename}}'
            | summarize ASR_Rule_Count = count() by ActionType

      - Name: DeviceAMSIEvents
        DisplayName: Suspicious Activities - ASMSI Script Detection
        Description: Script detection events from the Windows Antimalware Scan Interface (AMSI) in past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view AMSI events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where ActionType == "AmsiScriptDetection"
            | where Timestamp > ago(7d)
            | where DeviceName contains '{{devicename}}'
            | project Timestamp, InitiatingProcessFileName, SHA256, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessAccountName
            | sort by Timestamp desc 
 
      - Name: DeviceExploitGuard
        DisplayName: Suspicious Activities - Exploit Guard Events
        Description: Exploit Guard events detected on this device in past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view Exploit Guard events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where ActionType startswith 'ExploitGuard' and ActionType !contains 'NetworkProtection'
            | where Timestamp > ago(7d)
            | where DeviceName contains '{{devicename}}'
            | project Timestamp, ActionType, InitiatingProcessFileName, InitiatingProcessSHA256, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessAccountName           
            | sort by Timestamp desc 
 
      - Name: DeviceNetworkProtection
        DisplayName: Suspicious Activities - Network Protection Events
        Description: Network Protection events triggered on this device in the past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view Network Protection events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where Timestamp > ago(7d)
            | where ActionType contains "ExploitGuardNetworkProtection"
            | where DeviceName contains '{{devicename}}'
            | project Timestamp, ActionType, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName, RemoteUrl

      - Name: DeviceTamperingAttempt
        DisplayName: Suspicious Activities - Device Tampering Attempts
        Description: Possible tampering attempts on this device in the past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view possible tampering attempt events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where Timestamp > ago(7d)
            | where DeviceName contains '{{devicename}}'
            | where ActionType == "TamperingAttempt"
            | sort by Timestamp desc 